/*
九九の表を、2重の繰り返しを使って表示するプログラムを作成せよ。
2重の繰り返しを使わず単に表示するだけではダメ。値の間はタブ(\t)を使って間をあけること。
【実行例】
$ ./knock49
1	2	3	4	5	6	7	8	9	
2	4	6	8	10	12	14	16	18	
3	6	9	12	15	18	21	24	27	
4	8	12	16	20	24	28	32	36	
5	10	15	20	25	30	35	40	45	
6	12	18	24	30	36	42	48	54	
7	14	21	28	35	42	49	56	63	
8	16	24	32	40	48	56	64	72	
9	18	27	36	45	54	63	72	81
$ */
#include <stdio.h>
int main (void){
    int i, i2;
    for ( i2 = 1; i2 < 10; i2++ ){
        i = i2;
        for ( ; i < i2 * 10; i = i + i2){
            printf("%d\t", i);
        }
        printf("\n");
    }
    return 0;
}
